#coding=UTF-8
'''
一共有6种箱子，大小分别为1*1,2*2,3*3,4*4,5*5,6*6
货物可以装载在6种不同的箱子中，但最后都要装在6*6的箱子中运走
比如说6*6的箱子中可以装36个1*1的箱子,4个3*3,1个5*5
输入：1*1,2*2,3*3,4*4,5*5,6*6对应箱子的个数
输出：最终需要的6*6的箱子的个数
例：输入6 3 2 0 0 1
       输出2
'''
import math

a = [10, 3, 20, 5, 2, 1]

# 解决6*6
s = a[5]
a[5] = 0

# 解决5*5，并处理1*1
s += a[4]
a[0] = max(0, a[0]-9*a[4])
a[4] = 0

# 解决4*4， 并处理2*2
s += a[3]
a[1] = max(0, a[1]-5*a[3])
a[3] = 0

# 解决3*3，并处理2*2和1*1
s += math.ceil(a[2]//4)
if a[2]%4 > 0:
    left = 4 - a[2]%4
    temp = max(0, a[1]-(2*left+1))
    res = 9 * left - 4 * (a[1]-temp)
    a[1] = temp
    a[0] = max(0, a[0] - res)
a[2] = 0

# 解决2*2， 并处理1*1
s += math.ceil(a[1]//9)
if a[1]%9 > 0:
    left = 9 - a[1]%9
    res = 36 - left*4
    a[0] = max(0, a[0]-res)
a[1] = 0

s += math.ceil(a[0]//36)
print(s)


